[
    {
        "text": "There was a time when I thought my job title defined my worth. If I didn’t have a fancy designation, was I even successful?\n\nBut then I met:\n\nA 'security guard' who knew more about kindness than any CEO.\n\nA 'house help' who managed operations smoother than any manager.\n\nSuccess is not just about titles. It’s about the impact we create, the lives we touch, and the kindness we spread.\n\nYou are so much more. ❤️",
        "engagement": 120,
        "line_count": 7,
        "language": "English",
        "tags": [
            "Motivation",
            "Time Management"
        ]
    },
    {
        "text": "Why LinkedIn and Tinder are long-lost brothers:\n\n- Both can be used interchangeably. You can find jobs on Tinder and life partners on LinkedIn. (Networking *is* key, after all.)\n\n- Both have people posting glamorous pictures at beaches, bars, and fancy restaurants - because nothing says 'hire me' or 'date me' like a cocktail in hand.\n\n- Both have 'seen' and 'ignored' features—on Tinder, it’s your match ghosting you, and on LinkedIn, it’s recruiters leaving your InMail on read.",
        "engagement": 109,
        "line_count": 6,
        "language": "English",
        "tags": [
            "Online Dating",
            "Career"
        ]
    },
    {
        "text": "You were not ‘let go.’ You were strategically removed.\n\nCompanies don’t always fire you. Sometimes, they make you fire yourself.\n\nHere’s how silent layoffs work:\n\nYour workload doubles → But your salary stays the same.\n\nYour manager stops responding → Making it impossible to succeed.\n\nAnd then one day, you quit out of frustration.\n\nIf this is happening to you:\n\nStart documenting everything.\n\nLook for new roles before quitting.\n\nDon’t take it personally. It’s not you. It’s them.",
        "engagement": 133,
        "line_count": 11,
        "language": "English",
        "tags": [
            "Career",
            "Scams"
        ]
    },
    {
        "text": "My mother has decided to step on LinkedIn.\n\nShe wants to see 'Aisa kya daalti hai tu?'\n\nAlso ladka bhi yahi se dhundhne ka plan hai innka!\n\nSo if you see a random connection request from my mother, just know -\n\nShe’s either judging your profile… or considering your biodata.\n\nWelcome to LinkedIn, Maa. May the algorithm be ever in your favor.",
        "engagement": 267,
        "line_count": 7,
        "language": "Hinglish",
        "tags": [
            "Humor",
            "Family"
        ]
    },
    {
        "text": "Sabse Bada Scam-\n\nBachpan mein: 'Beta, bas achhe marks lelo, life set hai!'\n\nCollege mein: 'Beta, bas ek achhi job lag jaye, life set hai!'\n\nJob ke baad: 'Beta, bas ek ghar lelo, life set hai!'\n\nGhar lene ke baad: 'Beta, bas shaadi karlo, life set hai!'\n\nShaadi ke baad: 'Beta, bas ek bachha ho jaye, life set hai!'\n\nMoral of the story: Life kabhi set nahi hoti, bas EMI set hoti hai! 💸😂",
        "engagement": 117,
        "line_count": 7,
        "language": "Hinglish",
        "tags": [
            "Life Lessons",
            "Online Dating"
        ]
    },
    {
        "text": "What do you choose to focus on?\n\nTwo messages. Two completely different energies.\n\nOne filled with negativity, assumptions, and unnecessary hate. 😔\n\nThe other filled with kindness, appreciation, and encouragement.😌\n\nBoth exist on the same platform. Both were received on the same day. But the choice is ours - what do we let affect us more?\n\nWhat's the difference?\n\nOne came from a place of emptiness, the other from a place of abundance.\n\nResearch shows that people are 2.3 times more likely to remember negative experiences than positive ones (according to Dr. John Cacioppo’s neuroscience study on negativity bias).\n\nThat’s why one bad comment can ruin our mood, even if we receive ten positive ones.",
        "engagement": 210,
        "line_count": 11,
        "language": "English",
        "tags": [
            "Positivity",
            "Motivation"
        ]
    },
    {
        "text": "14-16 Years, paying 2-4 LPA.\n\nKhaane ke Paisa bhi nahi hoge.\n\nI mean, what do companies even smoke when trying to post such things?\n\nWhatever it is, the quality is good :)\n\n14 saal ka experience toh manga hai, but salary dekh ke lag raha hai fresher bhi sharm se resign de de!\n\nPerks of this legendary job:\n✅ Salary freshers se bhi fresh (Matlab bilkul zero growth)\n✅ Kaam CTO jitna, paisa internship jitna\n✅ Lunch break allowed, but lunch afford karna aapki zimmedaari\n✅ Company bolegi: ‘We offer work-life balance’ par work zyada aur life zero hogi.\n\nHR: 'Sir, aap passion ke liye kaam karo!'\nCandidate: 'Bhai, kiraye waale uncle passion nahi, rent maang rahe hain!",
        "engagement": 274,
        "line_count": 8,
        "language": "Hinglish",
        "tags": [
            "Mental Health",
            "Career"
        ]
    },
    {
        "text": "Whenever you start going on a downward spiral of emotions, do this 1 thing -\n\nWrite a few things you are grateful for.\n\nI remember how it has helped me, generally when we are in a bad situation we think - 'Nothing is going fine, everything is bad'\n\nThe thoughts of negativity start clouding you and you forget about the good things.\n\nOn my hardest days I have written 'Garlic Achaar' as a thing I am grateful for because it allows me to eat the bland food 🤭\n\nIf you look around, you'll find things that are fine, that are good and makes you happy, you just need to dive deeper :)\n\nSome days, your gratitude list will have big things -\n✅ A loving family\n✅ Supportive friends\n✅ A job that pays the bills",
        "engagement": 64,
        "line_count": 9,
        "language": "English",
        "tags": [
            "Mindfulness",
            "Gratitude"
        ]
    },
    {
        "text": "Whenever I have to watch something, I have to see 3-4 ads.\n\nI hope they don't start doing this while applying for jobs.\n\nImagine applying for a job and the ads of Power BI workshop coming to your feed and you start feeling -\n\nKya karu mein 5 lakh ki job ke liye apply karke, jabb INR 9 ke course se 42 lakhs ki job lagg rahi hai.\n\nBT ho jaayegi.",
        "engagement": 62,
        "line_count": 6,
        "language": "Hinglish",
        "tags": [
            "Scams",
            "Job Search"
        ]
    },
    {
        "text": "The 7 Stages of Love ❤️ (Corporate Edition)\n\nLove isn’t just about romance. If you've ever worked at a startup, switched jobs, or chased a dream, you’ve experienced these *7 stages of love* - whether you knew it or not.\n\n1️⃣ Dilkashi (Attraction) – You see a job post: ‘We are a family. Unlimited PTO. Work-life balance. 🚀’\nAnd boom! Love at first sight. You dream of a new life, a big paycheck, and respect (lol).\n\n2️⃣ Uns (Infatuation) – You get an interview call. HR says, ‘We loved your profile. You’re an amazing fit!’\n\nYou start daydreaming about company swag, Friday game nights, and Slack emojis that feel like home.\n\n3️⃣ Mohabbat (Love) – You get the job! The first month is magical. Onboarding feels like a honeymoon.\n\nFree coffee, friendly colleagues, and a manager who says, ‘We care about you",
        "engagement": 54,
        "line_count": 13,
        "language": "Hinglish",
        "tags": [
            "Startups",
            "Career"
        ]
    },
    {
        "text": "What an INR 2000 Resume Review couldn't do, I am able to do it, while charging less than INR 200 :)\n\nOne of my mentee's resume got shortlisted for a role in Google and he's waiting for the reply from Microsoft! (Bill Gates, if you’re reading this, hurry up).\n\nYour resume is literally your Tinder profile for jobs - if it doesn’t look good, no one’s swiping right. Fix it before recruiters left-swipe your career.\n\nHere's the link to book your Resume Review session -\n\nhttps://lnkd.in/gRU3hekp\n\nNow, two things you should know:\n\nPrice ≠ Quality. I keep my charges low because, as a broke student once, I know how it feels to pick between food and career investment.\n\nWhile most people love the effort I put into their resumes\n\nAlso, I have reduced the price for 1:1 Mentorships and Mock Interviews, so hit me up in case you need any help -\n\nMock Interview - https://lnkd.in/gbut2tHi\n\n1:1 Mentorship -",
        "engagement": 94,
        "line_count": 11,
        "language": "Hinglish",
        "tags": [
            "Influencer",
            "Career"
        ]
    },
    {
        "text": "Samajh nahi aa raha ki kya mushkil hai -\n\nPyaar dhundhna ya job?\n\nDono ke laale pade hue hai 🤦🏻‍♀️",
        "engagement": 656,
        "line_count": 3,
        "language": "Hinglish",
        "tags": [
            "Career",
            "Life Choices"
        ]
    }
]